## CREATING DATA FRAMES

In [1]:
import pandas as pd

### From Dictionary

In [2]:
dict01 = {'Age':[10,20,15],'Name':['Vinu','Anu','Dinu']}

data =pd.DataFrame(dict01)
data

In [5]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Age     3 non-null      int64
 1   Name    3 non-null      object
dtypes: int64(1), object(1)
memory usage: 176.0+ bytes

### DataFrame using Lists

In [6]:
names=["manu","Binu","Vinu"]
age=[27,26,25]

In [7]:
data1=pd.DataFrame(list(zip(names,age)),columns=['Names','Age'])
data1

  Names  Age
0  manu   27
1  Binu   26
2  Vinu   25

### DataFrame from Lists of Dictionaries

In [9]:
lst=[
    {'Name':'Arun','Age':29,'Gender':'Male'},
    {'Name':'Manu','Age':28,'Gender':'Male'},
    {'Name':'Safeer','Age':20,'Gender':'Male'},
     {'Name':'Radha','Age':27,'Gender':'Female'},
     {'Name':'Vivek','Age':28,'Gender':'Male'}
]

In [10]:
data2 = pd.DataFrame(lst)
data2

     Name  Age  Gender
0    Arun   29    Male
1    Manu   28    Male
2  Safeer   20    Male
3   Radha   27  Female
4   Vivek   28    Male

In [11]:
data

   Age  Name
0   10  Vinu
1   20   Anu
2   15  Dinu

In [12]:
data1

  Names  Age
0  manu   27
1  Binu   26
2  Vinu   25

In [13]:
data2

     Name  Age  Gender
0    Arun   29    Male
1    Manu   28    Male
2  Safeer   20    Male
3   Radha   27  Female
4   Vivek   28    Male